tap "hashicorp/tap"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "mongodb/brew"
tap "epk/epk"

# Formulae
brew "asciinema"
brew "aws/tap/aws-sam-cli"
brew "awscli"
brew "composer"
brew "fish"
brew "fzf"
brew "git"
brew "gh"
brew "go"
brew "terraform-ls"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "maven"
brew "neofetch"
brew "neovim"
brew "pyenv"
brew "python"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "fnm"
brew "tfenv"
brew "tmux"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "wrk"

# Casks
cask "alacritty"
cask "alfred"
cask "docker"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "grammarly"
cask "imageoptim"
cask "keycastr"
cask "loom"
cask "ngrok"
cask "postman"
cask "slack"
cask "sublime-text"
cask "transmit"
cask "visual-studio-code"
cask "vlc"

# Fonts
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-menlo-for-powerline"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-sourcecodepro-nerd-font"
cask "font-sourcecodepro-nerd-font-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto-mono"
cask "font-sf-mono-nerd-font"
