tap "hashicorp/tap"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "epk/epk"

# Formulae
brew "asciinema"
brew "awscli"
brew "bat"
brew "composer"
brew "exa"
brew "fish"
brew "git"
brew "gh"
brew "go"
brew "terraform-ls"
brew "htop"
brew "jq"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "pyenv"
brew "python"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "fnm"
brew "stylua"
brew "tfenv"
brew "tree"
brew "watchman"
brew "wget"
brew "wrk"

# Casks
cask "alfred"
cask "amethyst"
cask "android-studio"
cask "bartender"
cask "bitwarden"
cask "brave-browser"
cask "chromium"
cask "cleanshot"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "imageoptim"
cask "karabiner-elements"
cask "keycastr"
cask "microsoft-edge"
cask "mongodb-compass"
cask "mullvadvpn"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "postman"
cask "signal"
cask "slack"
cask "sublime-text"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"

# Fonts
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-menlo-for-powerline"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-sourcecodepro-nerd-font"
cask "font-sourcecodepro-nerd-font-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto-mono"
cask "font-sf-mono-nerd-font"
